БухЭксп/Catalogs/CW_ПодключаемыеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПодключаемыеОбъекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Встроенная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСубъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтладкаИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасполагатьНаРабочемСтоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ТипыПодключаемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВстроеннойОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПредставленияПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяВерсияМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МетодыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомандыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяКоманда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступностьОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаПользователей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасположениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_РазделыРабочегоСтола</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВнешнейКоманды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетаданныеКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормыОбъкта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппыДоступаКоманды</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасположениеГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередЭлементом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Макросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ТипыПодключаемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ТипыПодключаемыхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОтчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВнешниеПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВнешниеПодписки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодписки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыВнешнихПодписок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетаданноеПодписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсточникиПодписки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метаданное</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПодключаемыеОбъекты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМассивГруппПользователей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ГруппыПользователей.Ссылка КАК Ссылка,
	               |	CW_ГруппыПользователей.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.CW_ГруппыПользователей КАК CW_ГруппыПользователей
	               |ГДЕ
	               |	НЕ CW_ГруппыПользователей.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокГрупп = новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокГрупп.Добавить(Выборка.Ссылка,Выборка.Наименование);
	КонецЦикла;
	
	Возврат СписокГрупп;
	
КонецФункции

Функция ПолучитьСвязанныеВнешниеПодписки(Обработка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВнешниеПодписки.Ссылка КАК Подписка,
	               |	CW_ВнешниеПодписки.Обработка КАК Обработка
	               |ИЗ
	               |	Справочник.CW_ВнешниеПодписки КАК CW_ВнешниеПодписки
	               |ГДЕ
	               |	CW_ВнешниеПодписки.Обработка = &Обработка
	               |	И CW_ВнешниеПодписки.НеИспользуется = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Обработка"			, Обработка);
	
	РезультатЗапроса =  Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		
		ТаблицаРезультата = РезультатЗапроса.Выгрузить();
		
		Возврат  ТаблицаРезультата.ВыгрузитьКолонку("Подписка");
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПодключитьОбъектИПолучитьФорму(ПодключаемыйОбъект, ТипФормы = "ФормаОбъекта", АдресОбъекта="") Экспорт
	
	//СтруктурВозврата - тип "Структура"
	//- "РежимОткрытия" тип число:
	//		0 - Открыть форму внешней обработки;
	//		1 - Открыть форму редактирования параметра;
	//		3 - Отказ от открытия;
	//- "ТолькоПросмотр" 	- тип "булево";
	//- "ИмяФормы"			- тип "Строка";	
	СтруктураВозврата = новый Структура("РежимОткрытия,ТолькоПросмотр,ИмяФормы,ПодключаемыйОбъект, НеИспользуется",0,Ложь,Неопределено,ПодключаемыйОбъект,ПодключаемыйОбъект.НеИспользуется);
	
	_ПО.ПодключитьОбработку(ПодключаемыйОбъект);
	
	ВнешняяОбработка = _ПО.ПолучитьОбработку(ПодключаемыйОбъект);

	Попытка 
		ВнешняяОбработка.ПодключаемыйОбъект = ПодключаемыйОбъект;
	Исключение
	КонецПопытки;
	
	Попытка
		СтруктураИспользования = ВнешняяОбработка.Использование(АдресОбъекта);
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, СтруктураИспользования);
	Исключение
	КонецПопытки;
	
	Если СтруктураВозврата.РежимОткрытия = 0 Тогда
		ИмяФормы = _ПО.ПолучитьПолноеИмяФормыПоТипу(ПодключаемыйОбъект,ТипФормы);
	КонецЕсли;
	
	Если СтруктураВозврата.Свойство("ИмяФормы") Тогда
		СтруктураВозврата.ИмяФормы = ИмяФормы;
	Иначе
		СтруктураВозврата.Вставить("ИмяФормы", ИмяФормы);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ЗарегистрироватьВнешниеКоманды(СсылкаНаВнешнийОбъект) Экспорт
	
	Набор = РегистрыСведений.CW_ВнешниеКоманды.СоздатьНаборЗаписей();
	Набор.Отбор.Обработка.Установить(СсылкаНаВнешнийОбъект);
	Набор.Прочитать();
	Набор.Очистить();
	
	Если Не СсылкаНаВнешнийОбъект.НеИспользуется и не СсылкаНаВнешнийОбъект.ПометкаУдаления тогда
	
		УИД_команды = Новый УникальныйИдентификатор;
		ИмяКоманды = "Команда_"+СтрЗаменить(УИД_команды,"-","_");
		
		Для Каждого СтрокаВнешнихКоманд из СсылкаНаВнешнийОбъект.ПараметрыВнешнейКоманды Цикл
			
			СтрокаНабора = Набор.Добавить();
			
			СтрокаНабора.Обработка 			= СсылкаНаВнешнийОбъект;
			СтрокаНабора.Метаданное			= СтрокаВнешнихКоманд.МетаданныеКонфигурации;
			СтрокаНабора.ИмяФормыОбъкта 	= СтрокаВнешнихКоманд.ИмяФормыОбъкта;
			СтрокаНабора.ИмяТабличнойЧасти 	= СтрокаВнешнихКоманд.ИмяТабличнойЧасти;
			
			СтрокаНабора.Наименование 		= СтрокаВнешнихКоманд.ПредставлениеКоманды;
			СтрокаНабора.ИмяКартинки 		= СтрокаВнешнихКоманд.ИмяКартинки;
			СтрокаНабора.ИмяКоманды 		= ИмяКоманды;
			
			СтрокаНабора.Индекс 			= СтрокаВнешнихКоманд.Индекс;
			СтрокаНабора.ГруппыДоступа 		= СтрокаВнешнихКоманд.ГруппыДоступаКоманды;
			
			СтрокаНабора.РасположениеГруппы = СтрокаВнешнихКоманд.РасположениеГруппы;
			СтрокаНабора.ПередЭлементом 	= СтрокаВнешнихКоманд.ПередЭлементом;
		
		КонецЦикла;
		
		Набор.Отбор.Обработка.Установить(СсылкаНаВнешнийОбъект);
		
	КонецЕсли;
	
	Набор.Записать(истина);
	
КонецПроцедуры

Процедура ПроверитьАктуальностьВстроенныхОбработок() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПодключаемыеОбъекты.Ссылка КАК Ссылка,
	               |	CW_ПодключаемыеОбъекты.ИмяВстроеннойОбработки КАК ИмяВстроеннойОбработки,
	               |	CW_ПодключаемыеОбъекты.ТипВнешнегоОбъекта КАК ТипВнешнегоОбъекта
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	               |ГДЕ
	               |	CW_ПодключаемыеОбъекты.Встроенная = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ПроверитьВстроеннуюОбработку(Выборка.ИмяВстроеннойОбработки, Выборка.ТипВнешнегоОбъекта) Тогда
			ТОбъект =Выборка.Ссылка.ПолучитьОбъект();
			ТОбъект.НеИспользуется = истина;
			ТОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьВстроеннуюОбработку(ИмяВстроеннойОбработки, ТипВнешнегоОбъекта)
	
	Если ТипВнешнегоОбъекта = Перечисления.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет Тогда
		Метаданное = Метаданные.Отчеты.Найти(ИмяВстроеннойОбработки);
	КонецЕсли; 
	
	Если ТипВнешнегоОбъекта = Перечисления.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка Тогда
		Метаданное =  Метаданные.Обработки.Найти(ИмяВстроеннойОбработки);
	КонецЕсли;  
	
	Возврат Метаданное <> Неопределено;
	
КонецФункции



//Служебные процедуры
Функция ПолучитьСоответствиеТипов() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("Обработка",			ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка"));
	Результат.Вставить("ВнешняяОбработка",	ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка"));
	
	Результат.Вставить("Отчет",				ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет"));
	Результат.Вставить("ВнешнийОтчет", 		ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет"));	
	
	Возврат Результат;
	
КонецФункции       

Процедура ОбновитьПредставлениеВидаОбработки() Экспорт
	
	СоответствиеПредсталенийВида = CW_ПодключаемыеКомандыСервер.ПолучитьСоответствиеПредставленияВида();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПодключаемыеОбъекты.Ссылка КАК Ссылка,
	|	CW_ПодключаемыеОбъекты.Вид КАК Вид
	|ИЗ
	|	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	|ГДЕ
	|	CW_ПодключаемыеОбъекты.ЭтоГруппа = ЛОЖЬ";   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбработкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ОбработкаОбъект.ПредставлениеВида = СоответствиеПредсталенийВида.Получить(Выборка.Вид);;
		ОбработкаОбъект.ОбменДанными.Загрузка = Истина;
		ОбработкаОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры
//Служебные процедуры

#КонецЕсли
